


print("\t\tРізні в світі є країни,\n\tРізні люди є у світі,"
      "\n\tРізні гори, полонини,\n\tРізні трави, різні квіти."
      "\n\n\tЄ з усіх одна країна,\n\tНайрідніша нам усім,"
      "\n\tТо — прекрасна Україна,\n\tНашого народу дім."
      "\n\n\tТам шумлять степи безкраї,\n\tНаче вміють говорити,"
      "\n\tТам ясніше сонце сяє,\n\tТам солодше пахнуть квіти."
      "\n\n\tРізні в світі є країни,\n\tГарні є і є багаті,"
      "\n\tТа найкраще в Україні,\n\tБо найкраще в рідній хаті.")

